week10/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-17 Tue 11:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CMPUT201W20B2 Week 10</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abram Hindle" />
</head>
<body>
<div id="content">
<h1 class="title">CMPUT201W20B2 Week 10</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org972dd6c">1. Week10</a>
<ul>
<li><a href="#orgbcb6262">1.1. Copyright Statement</a>
<ul>
<li><a href="#org03250e2">1.1.1. License</a></li>
<li><a href="#orge3e35e7">1.1.2. Hazel Code is licensed under AGPL3.0+</a></li>
</ul>
</li>
<li><a href="#orga0d9136">1.2. Init ORG-MODE</a>
<ul>
<li><a href="#orgc7abf94">1.2.1. Org export</a></li>
<li><a href="#org8921097">1.2.2. Org Template</a></li>
</ul>
</li>
<li><a href="#org1b31c30">1.3. Remember how to compile?</a></li>
<li><a href="#org9498126">1.4. Preprocessor stuff like if-def</a>
<ul>
<li><a href="#orgacf5754">1.4.1. Multiple Files?</a></li>
<li><a href="#org35df772">1.4.2. Example</a></li>
<li><a href="#orgf29a547">1.4.3. Linking to libraries</a></li>
<li><a href="#orga6dea13">1.4.4. Example Datastructure</a></li>
<li><a href="#orge19a59d">1.4.5. What is the preprocessor doing?</a></li>
<li><a href="#org94c7d4c">1.4.6. Parameterized Macros</a></li>
</ul>
</li>
<li><a href="#org6b906da">1.5. Makefiles</a>
<ul>
<li><a href="#org7ea78d5">1.5.1. Basic Makefile</a></li>
<li><a href="#orgfdc0309">1.5.2. DRY Makefile</a></li>
<li><a href="#org687ce56">1.5.3. Idiomatic GCC Makefile</a></li>
<li><a href="#org2d82ba4">1.5.4. Special Macro Vars</a></li>
<li><a href="#orgfd8c903">1.5.5. Makefile help</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org972dd6c" class="outline-2">
<h2 id="org972dd6c"><span class="section-number-2">1</span> Week10</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbcb6262" class="outline-3">
<h3 id="orgbcb6262"><span class="section-number-3">1.1</span> Copyright Statement</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.
</p>

<p>
Otherwise it is (c) 2020 Abram Hindle, Hazel Campbell AGPL3.0+
</p>
</div>

<div id="outline-container-org03250e2" class="outline-4">
<h4 id="org03250e2"><span class="section-number-4">1.1.1</span> License</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
CMPUT 201 C Notes
Copyright (C) 2020 Abram Hindle, Hazel Campbell
</p>

<p>
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU Affero General Public License as
published by the Free Software Foundation, either version 3 of the
License, or (at your option) any later version.
</p>

<p>
This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU Affero General Public License for more details.
</p>

<p>
You should have received a copy of the GNU Affero General Public License
along with this program.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>


<div id="outline-container-orge3e35e7" class="outline-4">
<h4 id="orge3e35e7"><span class="section-number-4">1.1.2</span> Hazel Code is licensed under AGPL3.0+</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Hazel's code is also found here
<a href="https://github.com/hazelybell/examples/tree/C-2020-01">https://github.com/hazelybell/examples/tree/C-2020-01</a>
</p>

<p>
Hazel code is licensed: The example code is licensed under the AGPL3+
license, unless otherwise noted.
</p>
</div>
</div>
</div>

<div id="outline-container-orga0d9136" class="outline-3">
<h3 id="orga0d9136"><span class="section-number-3">1.2</span> Init ORG-MODE</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">I need this for org-mode to work well</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">If we have a new org-mode use ob-shell</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">otherwise use ob-sh --- but not both!</span>
(<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-shell</span> nil 'noerror)
  (<span style="color: #a020f0;">progn</span>
    (org-babel-do-load-languages 'org-babel-load-languages '((shell . t))))
  (<span style="color: #a020f0;">progn</span>
    (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-sh</span>)
    (org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(<span style="color: #a020f0;">setq</span> org-src-fontify-natively t)
(<span style="color: #a020f0;">setq</span> org-confirm-babel-evaluate nil) <span style="color: #b22222;">;; </span><span style="color: #b22222;">danger!</span>
(custom-set-faces
 '(org-block ((t (<span style="color: #483d8b;">:inherit</span> shadow <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"black"</span>))))
 '(org-code ((t (<span style="color: #483d8b;">:inherit</span> shadow <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"black"</span>)))))
</pre>
</div>
</div>

<div id="outline-container-orgc7abf94" class="outline-4">
<h4 id="orgc7abf94"><span class="section-number-4">1.2.1</span> Org export</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
</pre>
</div>
</div>
</div>


<div id="outline-container-org8921097" class="outline-4">
<h4 id="org8921097"><span class="section-number-4">1.2.2</span> Org Template</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Copy and paste this to demo C
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1b31c30" class="outline-3">
<h3 id="org1b31c30"><span class="section-number-3">1.3</span> Remember how to compile?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 -o programname programname.c
</p>
</div>
</div>

<div id="outline-container-org9498126" class="outline-3">
<h3 id="org9498126"><span class="section-number-3">1.4</span> Preprocessor stuff like if-def</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The preprocessor deals with all the lines that you start with an
octalthrope or hash mark: #
</p>

<p>
The preprocessor lets you define symbols, macros, and include
files.
</p>
</div>

<div id="outline-container-orgacf5754" class="outline-4">
<h4 id="orgacf5754"><span class="section-number-4">1.4.1</span> Multiple Files?</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
How does stdio.h work?
</p>

<p>
<a href="file:///usr/include/stdio.h">file:///usr/include/stdio.h</a>
</p>

<p>
It defines definitions, macros, and prototypes for the stdio library.
The linker will link your executable to that library that was already
compiled.
</p>

<p>
.h files help us organize C programs by including definitions for the
object files and libraries that we will create.
</p>

<p>
Libc or glibc contains the implemention of those definitions.
libc.so.6 =&gt; /lib/x86<sub>64</sub>-linux-gnu/libc.so.6 (0x00007f919f994000)
</p>

<p>
libc is composed of many .c files compiled into .o object files and
then combined into a library. A library is like an executable that
other executables rely on for code. malloc is defined in malloc.c and
has a malloc.h file!
</p>

<p>
Typically if I make a library I will make a .h file so the definitions
can be shared with other .c files. But the implementation of the functions
will go into a .c file that includes that .h as well.
</p>

<ul class="org-ul">
<li>main.c
<ul class="org-ul">
<li>#include "library.h"</li>
<li>relies on library.o</li>
</ul></li>
<li>library.c
<ul class="org-ul">
<li>#include "library.h"</li>
<li>makes library.o</li>
</ul></li>
<li>library.h
<ul class="org-ul">
<li>defines functions and definitions from library.c</li>
</ul></li>
</ul>
</div>
</div>
