week10/presentation.org
*** Example 

This is a useful function to check if scanf read 1 or more elements
and didn't read EOF.

file:./checkinput.c

#+BEGIN_SRC C :exports both :tangle checkinput.c :main no
#include "checkinput.h"
#include <stdio.h>
#include <stdlib.h>
/* checkInput: given the result of scanf check if it 
 * 0 elements read or EOF. If so exit(1) with a warning.
 *
 */
void checkInput(int err) {
  if (!err || err == EOF) {
    printf("\nInvalid input!\n");
    exit(1);
  }
}
#+END_SRC 

#+RESULTS:

file:./checkinput.h

#+BEGIN_SRC C :exports both :tangle checkinput.h :main no
// Have a guard to ensure that we don't include it multiple times.
#ifndef _CHECKINPUT_H_
/* checkInput: given the result of scanf check if it 
 * 0 elements read or EOF. If so exit(1) with a warning.
 *
 */
#define _CHECKINPUT_H_
void checkInput(int err); // a prototype!
#endif
#+END_SRC 

#+RESULTS:

file:./checkinput-driver.c

#+BEGIN_SRC C :exports both :tangle checkinput-driver.c
#include "checkinput.h"
#include <stdio.h>
#include "checkinput.h"

int main() {
  int input;
  checkInput(scanf("%d", &input));  
  puts("Good Input!");
}
#+END_SRC 

#+RESULTS:

**** Compiling Multiple Files Easy Mode

We can put all our .c files on the same line and compile them all at
once! This is handy. But quite limiting.

We can't parallel compile. We can't use all our cores. We can't
interupt compilation.

#+BEGIN_SRC sh :exports both :tangle build-checkinput-easy.sh
# build checkinput-driver
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -o checkinput-driver checkinput-driver.c \
       checkinput.c && \
( echo YES | ./checkinput-driver  || \
  echo 100 | ./checkinput-driver )
#+END_SRC

#+RESULTS:
: 
: Invalid input!
: Good Input!


**** Compiling Multiple Files with Linking

OK now we compile it. The main is the last to compile and it needs all
the .o files.

All the .c files that don't contain main need to be compiled to object
files. Use the -c flags to do this.

#+BEGIN_SRC sh :exports both :tangle build-checkinput.sh
# build checkinput.o
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -c checkinput.c
file checkinput.o
# build checkinput-driver and link it to checkinput.o
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -o checkinput-driver checkinput-driver.c \
       checkinput.o
file checkinput-driver
#+END_SRC

#+RESULTS:
: checkinput.o: ELF 64-bit LSB relocatable, x86-64, version 1 (SYSV), with debug_info, not stripped
: checkinput-driver: ELF 64-bit LSB shared object, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/l, for GNU/Linux 3.2.0, BuildID[sha1]=2df2006fd89c9d9dbc9655f59e4cf90c6d3f6017, with debug_info, not stripped

- If you want some translation :-)
  - ELF - Executable and Linking format
  - relocatable - you can link it
  - shared object - relocatable and executable
  - LSB - little endian/least significant bit
  - x86-64 - 64 bit x86 processor
  - version 1 (SYSV) - version 1 of ELF System V Unix spec.

Test drive it

#+BEGIN_SRC sh :exports both
echo    | ./checkinput-driver # bad
echo X  | ./checkinput-driver # bad
echo 1  | ./checkinput-driver # good
echo -1 | ./checkinput-driver # good
#+END_SRC

#+RESULTS:
: 
: Invalid input!
: 
: Invalid input!
: Good Input!
: Good Input!

Now let's see how it is linked!

#+BEGIN_SRC sh
ldd ./checkinput-driver
#+END_SRC

#+RESULTS:
: 	linux-vdso.so.1 (0x00007ffe85be0000)
: 	libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007f919f994000)
: 	/lib64/ld-linux-x86-64.so.2 (0x00007f919ff87000)

- syscalls (read, write, gettimeofday) and libc (libc is stuff like stdio.h)

