week10/presentation.html

<div id="outline-container-org35df772" class="outline-4">
<h4 id="org35df772"><span class="section-number-4">1.4.2</span> Example</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
This is a useful function to check if scanf read 1 or more elements
and didn't read EOF.
</p>

<p>
<a href="./checkinput.c">./checkinput.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"checkinput.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #b22222;">/* </span><span style="color: #b22222;">checkInput: given the result of scanf check if it </span>
<span style="color: #b22222;"> * 0 elements read or EOF. If so exit(1) with a warning.</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">checkInput</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">err</span>) {
  <span style="color: #a020f0;">if</span> (!err || err == EOF) {
    printf(<span style="color: #8b2252;">"\nInvalid input!\n"</span>);
    exit(1);
  }
}
</pre>
</div>

<p>
<a href="./checkinput.h">./checkinput.h</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Have a guard to ensure that we don't include it multiple times.</span>
<span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> _CHECKINPUT_H_
<span style="color: #b22222;">/* </span><span style="color: #b22222;">checkInput: given the result of scanf check if it </span>
<span style="color: #b22222;"> * 0 elements read or EOF. If so exit(1) with a warning.</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">_CHECKINPUT_H_</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">checkInput</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">err</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>
<span style="color: #483d8b;">#endif</span>
</pre>
</div>

<p>
<a href="./checkinput-driver.c">./checkinput-driver.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"checkinput.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"checkinput.h"</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">input</span>;
  checkInput(scanf(<span style="color: #8b2252;">"%d"</span>, &amp;input));  
  puts(<span style="color: #8b2252;">"Good Input!"</span>);
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgf53e29a"></a>Compiling Multiple Files Easy Mode<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
We can put all our .c files on the same line and compile them all at
once! This is handy. But quite limiting.
</p>

<p>
We can't parallel compile. We can't use all our cores. We can't
interupt compilation.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build checkinput-driver</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o checkinput-driver checkinput-driver.c <span style="color: #8b2252;">\</span>
       checkinput.c &amp;&amp; <span style="color: #8b2252;">\</span>
( <span style="color: #483d8b;">echo</span> YES | ./checkinput-driver  || <span style="color: #8b2252;">\</span>
  <span style="color: #483d8b;">echo</span> 100 | ./checkinput-driver )
</pre>
</div>

<pre class="example">

Invalid input!
Good Input!
</pre>
</div>
</li>


<li><a id="org457e5b7"></a>Compiling Multiple Files with Linking<br />
<div class="outline-text-5" id="text-1-4-2-2">
<p>
OK now we compile it. The main is the last to compile and it needs all
the .o files.
</p>

<p>
All the .c files that don't contain main need to be compiled to object
files. Use the -c flags to do this.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build checkinput.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -c checkinput.c
file checkinput.o
<span style="color: #b22222;"># </span><span style="color: #b22222;">build checkinput-driver and link it to checkinput.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o checkinput-driver checkinput-driver.c <span style="color: #8b2252;">\</span>
       checkinput.o
file checkinput-driver
</pre>
</div>

<pre class="example">
checkinput.o: ELF 64-bit LSB relocatable, x86-64, version 1 (SYSV), with debug_info, not stripped
checkinput-driver: ELF 64-bit LSB shared object, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/l, for GNU/Linux 3.2.0, BuildID[sha1]=2df2006fd89c9d9dbc9655f59e4cf90c6d3f6017, with debug_info, not stripped
</pre>


<ul class="org-ul">
<li>If you want some translation :-)
<ul class="org-ul">
<li>ELF - Executable and Linking format</li>
<li>relocatable - you can link it</li>
<li>shared object - relocatable and executable</li>
<li>LSB - little endian/least significant bit</li>
<li>x86-64 - 64 bit x86 processor</li>
<li>version 1 (SYSV) - version 1 of ELF System V Unix spec.</li>
</ul></li>
</ul>

<p>
Test drive it
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">echo</span>    | ./checkinput-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">bad</span>
<span style="color: #483d8b;">echo</span> X  | ./checkinput-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">bad</span>
<span style="color: #483d8b;">echo</span> 1  | ./checkinput-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">good</span>
<span style="color: #483d8b;">echo</span> -1 | ./checkinput-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">good</span>
</pre>
</div>

<pre class="example">

Invalid input!

Invalid input!
Good Input!
Good Input!
</pre>


<p>
Now let's see how it is linked!
</p>

<div class="org-src-container">
<pre class="src src-sh">ldd ./checkinput-driver
</pre>
</div>

<pre class="example">
linux-vdso.so.1 (0x00007ffe85be0000)
libc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007f919f994000)
/lib64/ld-linux-x86-64.so.2 (0x00007f919ff87000)
</pre>


<ul class="org-ul">
<li>syscalls (read, write, gettimeofday) and libc (libc is stuff like stdio.h)</li>
</ul>
</div>
</li>
</ol>
</div>
