week10/presentation.html

<div id="outline-container-orgf29a547" class="outline-4">
<h4 id="orgf29a547"><span class="section-number-4">1.4.3</span> Linking to libraries</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
`math.h` includes fun functions like cos and tanh.
</p>

<p>
Math.h, part of the C stdlib, is distributed as a seperate library.
Not all computers have floating point numbers so why bother compiling
floating code for them?
</p>

<p>
<a href="file:///usr/include/math.h">file:///usr/include/math.h</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">gnome-terminal --window-with-profile Big <span style="color: #8b2252;">\</span>
               -- man math.h
</pre>
</div>

<p>
I add the flag -lm so we get our math library :-)
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span> = 0.0;
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">th</span> = tanh(x);
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">lh</span> = th;
    <span style="color: #a020f0;">do</span> {
        lh = th;
        x += 0.5;
        th = tanh(x);
        printf(<span style="color: #8b2252;">"tanh(%e) == %e\n"</span>, x, th);
    } <span style="color: #a020f0;">while</span>( lh != th );
}
</pre>
</div>

<pre class="example">
tanh(5.000000e-01) == 4.621172e-01
tanh(1.000000e+00) == 7.615942e-01
tanh(1.500000e+00) == 9.051483e-01
tanh(2.000000e+00) == 9.640276e-01
tanh(2.500000e+00) == 9.866143e-01
tanh(3.000000e+00) == 9.950548e-01
tanh(3.500000e+00) == 9.981779e-01
tanh(4.000000e+00) == 9.993293e-01
tanh(4.500000e+00) == 9.997532e-01
tanh(5.000000e+00) == 9.999092e-01
tanh(5.500000e+00) == 9.999666e-01
tanh(6.000000e+00) == 9.999877e-01
tanh(6.500000e+00) == 9.999955e-01
tanh(7.000000e+00) == 9.999983e-01
tanh(7.500000e+00) == 9.999994e-01
tanh(8.000000e+00) == 9.999998e-01
tanh(8.500000e+00) == 9.999999e-01
tanh(9.000000e+00) == 1.000000e+00
tanh(9.500000e+00) == 1.000000e+00
tanh(1.000000e+01) == 1.000000e+00
tanh(1.050000e+01) == 1.000000e+00
tanh(1.100000e+01) == 1.000000e+00
tanh(1.150000e+01) == 1.000000e+00
tanh(1.200000e+01) == 1.000000e+00
tanh(1.250000e+01) == 1.000000e+00
tanh(1.300000e+01) == 1.000000e+00
tanh(1.350000e+01) == 1.000000e+00
tanh(1.400000e+01) == 1.000000e+00
tanh(1.450000e+01) == 1.000000e+00
tanh(1.500000e+01) == 1.000000e+00
tanh(1.550000e+01) == 1.000000e+00
tanh(1.600000e+01) == 1.000000e+00
tanh(1.650000e+01) == 1.000000e+00
tanh(1.700000e+01) == 1.000000e+00
tanh(1.750000e+01) == 1.000000e+00
tanh(1.800000e+01) == 1.000000e+00
tanh(1.850000e+01) == 1.000000e+00
tanh(1.900000e+01) == 1.000000e+00
tanh(1.950000e+01) == 1.000000e+00
tanh(2.000000e+01) == 1.000000e+00
</pre>

<p>
OK so how does this work, how do link to math?
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build checkinput-driver and link it to checkinput.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o poor-tanh-example poor-tanh-example.c <span style="color: #8b2252;">\</span>
       -lm
file poor-tanh-example
./poor-tanh-example | wc
ldd ./poor-tanh-example
</pre>
</div>

<pre class="example">
poor-tanh-example: ELF 64-bit LSB shared object, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/l, for GNU/Linux 3.2.0, BuildID[sha1]=fdd28691d4637c2a9b9a76b129ea7585894e4378, with debug_info, not stripped
     40     120    1400
	linux-vdso.so.1 (0x00007ffdd1570000)
	libm.so.6 =&gt; /lib/x86_64-linux-gnu/libm.so.6 (0x00007f4ed467b000)
	libc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007f4ed428a000)
	/lib64/ld-linux-x86-64.so.2 (0x00007f4ed4c1b000)
</pre>


<p>
See that? libm.so.6 is in there.
</p>

<p>
Larger programs link to lots of libraries.
</p>

<div class="org-src-container">
<pre class="src src-sh">ldd <span style="color: #ff00ff;">`which xterm`</span>
</pre>
</div>

<pre class="example">
linux-vdso.so.1 (0x00007ffdabcea000)
libXft.so.2 =&gt; /usr/lib/x86_64-linux-gnu/libXft.so.2 (0x00007fc90b414000)
libfontconfig.so.1 =&gt; /usr/lib/x86_64-linux-gnu/libfontconfig.so.1 (0x00007fc90b1cf000)
libXaw.so.7 =&gt; /usr/lib/x86_64-linux-gnu/libXaw.so.7 (0x00007fc90af5b000)
libXmu.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libXmu.so.6 (0x00007fc90ad42000)
libXt.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libXt.so.6 (0x00007fc90aad9000)
libX11.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libX11.so.6 (0x00007fc90a7a1000)
libXinerama.so.1 =&gt; /usr/lib/x86_64-linux-gnu/libXinerama.so.1 (0x00007fc90a59e000)
libXpm.so.4 =&gt; /usr/lib/x86_64-linux-gnu/libXpm.so.4 (0x00007fc90a38c000)
libICE.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libICE.so.6 (0x00007fc90a171000)
libutempter.so.0 =&gt; /usr/lib/x86_64-linux-gnu/libutempter.so.0 (0x00007fc909f6e000)
libtinfo.so.5 =&gt; /lib/x86_64-linux-gnu/libtinfo.so.5 (0x00007fc909d44000)
libc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007fc909953000)
libfreetype.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libfreetype.so.6 (0x00007fc90969f000)
libXrender.so.1 =&gt; /usr/lib/x86_64-linux-gnu/libXrender.so.1 (0x00007fc909495000)
libexpat.so.1 =&gt; /lib/x86_64-linux-gnu/libexpat.so.1 (0x00007fc909263000)
libpthread.so.0 =&gt; /lib/x86_64-linux-gnu/libpthread.so.0 (0x00007fc909044000)
libXext.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libXext.so.6 (0x00007fc908e32000)
libSM.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libSM.so.6 (0x00007fc908c2a000)
libxcb.so.1 =&gt; /usr/lib/x86_64-linux-gnu/libxcb.so.1 (0x00007fc908a02000)
libdl.so.2 =&gt; /lib/x86_64-linux-gnu/libdl.so.2 (0x00007fc9087fe000)
libbsd.so.0 =&gt; /lib/x86_64-linux-gnu/libbsd.so.0 (0x00007fc9085e9000)
/lib64/ld-linux-x86-64.so.2 (0x00007fc90b8d9000)
libpng16.so.16 =&gt; /usr/lib/x86_64-linux-gnu/libpng16.so.16 (0x00007fc9083b7000)
libz.so.1 =&gt; /lib/x86_64-linux-gnu/libz.so.1 (0x00007fc90819a000)
libuuid.so.1 =&gt; /lib/x86_64-linux-gnu/libuuid.so.1 (0x00007fc907f93000)
libXau.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libXau.so.6 (0x00007fc907d8f000)
libXdmcp.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libXdmcp.so.6 (0x00007fc907b89000)
librt.so.1 =&gt; /lib/x86_64-linux-gnu/librt.so.1 (0x00007fc907981000)
libm.so.6 =&gt; /lib/x86_64-linux-gnu/libm.so.6 (0x00007fc9075e3000)
</pre>

<p>
See! Lots of libraries!
</p>
</div>

<ol class="org-ol">
<li><a id="org7252522"></a>Summary<br />
<div class="outline-text-5" id="text-1-4-3-1">
<p>
To link to a shared library with gcc or clang use the:
  -l flag
  -llibraryyouwant
</p>

<p>
For libm use -lm for librt use -lrt
</p>

<p>
If your library is not in the current lib path you will need to
specify a library path use -L/path/to/library
</p>

<p>
OK let's see how it affects you.
</p>
</div>
</li>
</ol>
</div>
