week10/presentation.html

<div id="outline-container-orga6dea13" class="outline-4">
<h4 id="orga6dea13"><span class="section-number-4">1.4.4</span> Example Datastructure</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Let's make a brief data structure about one of my favourite topics:
cool bears.
</p>

<p>
<a href="./coolbears.c">./coolbears.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">_POSIX_C_SOURCE</span> 200809L <span style="color: #b22222;">// </span><span style="color: #b22222;">&lt;-- needed for strdup</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"coolbears.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">hiding struct details from other programmers</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">I DONT TRUST THEM. Especially Hazel ;-) (don't tell hazel)</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coolbear_t</span> {
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">temperature</span>;
};

<span style="color: #228b22;">CoolBear</span> <span style="color: #0000ff;">createCoolBear</span>(<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>, <span style="color: #228b22;">float</span> <span style="color: #a0522d;">temperature</span>) {
    <span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolbear</span> = malloc(<span style="color: #a020f0;">sizeof</span>(*coolbear));
    coolbear-&gt;name = strdup(name);
    coolbear-&gt;temperature = temperature;
    <span style="color: #a020f0;">return</span> coolbear;
}
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">freeCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolBear</span>) {
    <span style="color: #a020f0;">if</span> (coolBear == <span style="color: #008b8b;">NULL</span>) {
        abort();
    }
    <span style="color: #a020f0;">if</span> (coolBear-&gt;name != <span style="color: #008b8b;">NULL</span>) {
        free(coolBear-&gt;name);
    }
    free(coolBear);
}
<span style="color: #228b22;">char</span> * <span style="color: #0000ff;">getNameCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolbear</span>) {
    <span style="color: #a020f0;">return</span> coolbear-&gt;name;
}
<span style="color: #228b22;">float</span>    <span style="color: #0000ff;">getTemperatureCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolbear</span>) {
   <span style="color: #a020f0;">return</span> coolbear-&gt;temperature;
}
<span style="color: #b22222;">// </span><span style="color: #b22222;">NO MAIN!</span>
</pre>
</div>



<p>
<a href="./coolbears.h">./coolbears.h</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Have a guard to ensure that we don't include it multiple times.</span>
<span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> _COOLBEARS_H_
<span style="color: #b22222;">/* </span><span style="color: #b22222;">checkInput: given the result of scanf check if it </span>
<span style="color: #b22222;"> * 0 elements read or EOF. If so exit(1) with a warning.</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">_COOLBEARS_H_</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coolbear_t</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">Forward declaration -- I am not sharing details!</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coolbear_t</span> * <span style="color: #228b22;">CoolBear</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">Struct point as type</span>

<span style="color: #228b22;">CoolBear</span> <span style="color: #0000ff;">createCoolBear</span>(<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>, <span style="color: #228b22;">float</span> <span style="color: #a0522d;">temperature</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>
<span style="color: #228b22;">void</span>     <span style="color: #0000ff;">freeCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolBear</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>
<span style="color: #228b22;">char</span> *   <span style="color: #0000ff;">getNameCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolbear</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>
<span style="color: #228b22;">float</span>    <span style="color: #0000ff;">getTemperatureCoolBear</span>(<span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolbear</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>

<span style="color: #483d8b;">#endif</span>
</pre>
</div>

<p>
<a href="./coolbears-driver.c">./coolbears-driver.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"coolbears.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">ziggy</span> = createCoolBear(<span style="color: #8b2252;">"Ziggy"</span>,-23.0 <span style="color: #b22222;">/* </span><span style="color: #b22222;">C </span><span style="color: #b22222;">*/</span>);
  <span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">kevin</span> = createCoolBear(<span style="color: #8b2252;">"Kevin"</span>,-32.0 <span style="color: #b22222;">/* </span><span style="color: #b22222;">C </span><span style="color: #b22222;">*/</span>);
  <span style="color: #228b22;">CoolBear</span> <span style="color: #a0522d;">coolest</span> = (getTemperatureCoolBear(ziggy) &lt; 
                      getTemperatureCoolBear(kevin))? ziggy : kevin;
  printf(<span style="color: #8b2252;">"The coolest bear is %s\n"</span>, getNameCoolBear( coolest ));
  <span style="color: #b22222;">// </span><span style="color: #b22222;">// we actually don't know about name so we can't reference it below</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">printf("The coolest bear is %s\n", getNameCoolBear( coolest-&gt;name ));</span>
  freeCoolBear(ziggy);
  freeCoolBear(kevin);
}
</pre>
</div>

<p>
Compile it. -c the coolbears.c to make coolbears.o and then 
compile coolbears-driver.c
</p>

<p>
coolbears-driver.c has no clue how to access 
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build coolbears.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -c coolbears.c
<span style="color: #b22222;"># </span><span style="color: #b22222;">build coolbears-driver and link it to coolbears.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o coolbears-driver coolbears-driver.c <span style="color: #8b2252;">\</span>
       coolbears.o 
./coolbears-driver
</pre>
</div>

<pre class="example">
The coolest bear is Kevin
</pre>


<p>
If we access coolest-&gt;name we get:
</p>

<pre class="example">
coolbears-driver.c: In function ‘main’:
coolbears-driver.c:11:62: error: dereferencing pointer to incomplete type ‘struct coolbear_t’
   printf("The coolest bear is %s\n", getNameCoolBear( coolest-&gt;name ));
</pre>
</div>
</div>
