week10/presentation.html


<div id="outline-container-orge19a59d" class="outline-4">
<h4 id="orge19a59d"><span class="section-number-4">1.4.5</span> What is the preprocessor doing?</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Let's use the -E flag to see what checkinput.c becomes
</p>

<p>
This output contains glibc headers for stdio.h and stdlib.h these
should be under the GPLV3 (c) the Glibc project and GNU project.
</p>

<p>
If you want more preprocessor options checkout:
</p>

<p>
<a href="https://gcc.gnu.org/onlinedocs/gcc-5.2.0/gcc/Preprocessor-Options.html">https://gcc.gnu.org/onlinedocs/gcc-5.2.0/gcc/Preprocessor-Options.html</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build checkinput.o</span>
gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       checkinput.c &gt; checkinput-preprocessor.c
</pre>
</div>

<p>
It produces this file:
</p>

<p>
<a href="checkinput-preprocessor.c">checkinput-preprocessor.c</a>
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;"># 1</span> <span style="color: #8b2252;">"checkinput.c"</span>
<span style="color: #483d8b;"># 1</span> <span style="color: #8b2252;">"/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week10//"</span>
<span style="color: #483d8b;"># 1</span> <span style="color: #8b2252;">"&lt;built-in&gt;"</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__STDC__</span> 1
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__STDC_VERSION__</span> 199901L
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__STDC_HOSTED__</span> 1
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__GNUC__</span> 7
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__GNUC_MINOR__</span> 5
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">__GNUC_PATCHLEVEL__</span> 0

<span style="color: #b22222;">// </span><span style="color: #b22222;">lots of definitions</span>

<span style="color: #483d8b;"># 1</span> <span style="color: #8b2252;">"/usr/include/stdio.h"</span> 1 3 4
<span style="color: #483d8b;"># 24</span> <span style="color: #8b2252;">"/usr/include/stdio.h"</span> 3 4
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">_STDIO_H</span> 1

<span style="color: #b22222;">// </span><span style="color: #b22222;">Start of STDIO_H</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">...</span>

<span style="color: #a020f0;">extern</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">printf</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">__restrict</span> __format, ...);

<span style="color: #a020f0;">extern</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">sprintf</span> (<span style="color: #228b22;">char</span> *<span style="color: #a0522d;">__restrict</span> __s,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">__restrict</span> __format, ...) <span style="color: #a020f0;">__attribute__</span> ((__nothrow__));


<span style="color: #b22222;">// </span><span style="color: #b22222;">LOTS OF STDIO.H</span>


<span style="color: #b22222;">// </span><span style="color: #b22222;">LOTS OF STDLIB.H</span>

<span style="color: #483d8b;"># 1016</span> <span style="color: #8b2252;">"/usr/include/stdlib.h"</span> 3 4
<span style="color: #483d8b;"># 1</span> <span style="color: #8b2252;">"/usr/include/x86_64-linux-gnu/bits/stdlib-float.h"</span> 1 3 4
<span style="color: #483d8b;"># 1017</span> <span style="color: #8b2252;">"/usr/include/stdlib.h"</span> 2 3 4
<span style="color: #483d8b;"># 1026</span> <span style="color: #8b2252;">"/usr/include/stdlib.h"</span> 3 4

<span style="color: #483d8b;"># 5</span> <span style="color: #8b2252;">"checkinput.c"</span> 2





<span style="color: #483d8b;"># 9</span> <span style="color: #8b2252;">"checkinput.c"</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">checkInput</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">err</span>) {
  <span style="color: #a020f0;">if</span> (!err || err == 
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinput.c"</span> 3 4
                    (-1)
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinput.c"</span>
                       ) {
    printf(<span style="color: #8b2252;">"\nInvalid input!\n"</span>);
    exit(1);
  }
}
<span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<p>
<a href="checkinput-preprocessor.c">checkinput-preprocessor.c</a>
</p>
</div>
</div>
