week10/presentation.html


<div id="outline-container-org94c7d4c" class="outline-4">
<h4 id="org94c7d4c"><span class="section-number-4">1.4.6</span> Parameterized Macros</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
As we just demonstrated Macros generate code. So we can make compile
functions that generate code. These functions run at compile time and
generate code that is compiled by C.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">RELU is a rectified linear unit. These are popular in convolutional neural networks</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">they are 0 for 0 and negative numbers and they are the identity for positive numbers.</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">RELU(-100) = RELU(-1) = 0 &amp;&amp; RELU(1) = 1 &amp;&amp; RELU(100) = 100</span>
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">RELU</span>(<span style="color: #a0522d;">x</span>)  (( x &lt; 0 )?0:x)

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">ints</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = -10; i &lt; 10; i++) {
        printf(<span style="color: #8b2252;">"RELU(%d)=%d\n"</span>, i, RELU(i));
    }
    puts(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">more in the range of neural networks</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">double</span> <span style="color: #a0522d;">i</span> = -1; i &lt; 1; i+=0.1) {
        printf(<span style="color: #8b2252;">"RELU(%f)=%f\n"</span>, i, RELU(i));
    }
    puts(<span style="color: #8b2252;">"\n"</span>);
}
</pre>
</div>

<pre class="example">
RELU(-10)=0
RELU(-9)=0
RELU(-8)=0
RELU(-7)=0
RELU(-6)=0
RELU(-5)=0
RELU(-4)=0
RELU(-3)=0
RELU(-2)=0
RELU(-1)=0
RELU(0)=0
RELU(1)=1
RELU(2)=2
RELU(3)=3
RELU(4)=4
RELU(5)=5
RELU(6)=6
RELU(7)=7
RELU(8)=8
RELU(9)=9


RELU(-1.000000)=0.000000
RELU(-0.900000)=0.000000
RELU(-0.800000)=0.000000
RELU(-0.700000)=0.000000
RELU(-0.600000)=0.000000
RELU(-0.500000)=0.000000
RELU(-0.400000)=0.000000
RELU(-0.300000)=0.000000
RELU(-0.200000)=0.000000
RELU(-0.100000)=0.000000
RELU(-0.000000)=0.000000
RELU(0.100000)=0.100000
RELU(0.200000)=0.200000
RELU(0.300000)=0.300000
RELU(0.400000)=0.400000
RELU(0.500000)=0.500000
RELU(0.600000)=0.600000
RELU(0.700000)=0.700000
RELU(0.800000)=0.800000
RELU(0.900000)=0.900000
RELU(1.000000)=1.000000
</pre>

<div class="org-src-container">
<pre class="src src-sh">gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       relu.c &gt; <span style="color: #8b2252;">\</span>
       relu-expanded.c
</pre>
</div>

<p>
<a href="relu-expanded.c">relu-expanded.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">RELU</span>(<span style="color: #a0522d;">x</span>) (( x &lt; 0 )?0:x)


<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"relu.c"</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = -10; i &lt; 10; i++) {
        printf(<span style="color: #8b2252;">"RELU(%d)=%d\n"</span>, i, (( i &lt; 0 )?0:i));
    }
    puts(<span style="color: #8b2252;">"\n"</span>);

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">double</span> <span style="color: #a0522d;">i</span> = -1; i &lt; 1; i+=0.1) {
        printf(<span style="color: #8b2252;">"RELU(%f)=%f\n"</span>, i, (( i &lt; 0 )?0:i));
    }
    puts(<span style="color: #8b2252;">"\n"</span>);
}
</pre>
</div>

<p>
That's interesting, but be aware that x is not a value. It is a set of tokens.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">RELU is a rectified linear unit. These are popular in convolutional neural networks</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">they are 0 for 0 and negative numbers and they are the identity for positive numbers.</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">RELU(-100) = RELU(-1) = 0 &amp;&amp; RELU(1) = 1 &amp;&amp; RELU(100) = 100</span>
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">RELU</span>(<span style="color: #a0522d;">x</span>)  (( x &lt; 0 )?0:x)

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span> = 2.0;
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">y</span> = 127.1;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">How many times will pow(x,y) run?</span>
    printf(<span style="color: #8b2252;">"%f\n"</span>, RELU(pow(x,y)));

}
</pre>
</div>

<pre class="example">
1.8235280531744908e+38
</pre>


<div class="org-src-container">
<pre class="src src-sh">gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       relu2.c &gt; <span style="color: #8b2252;">\</span>
       relu2-expanded.c
</pre>
</div>

<p>
<a href="relu2-expanded.c">relu2-expanded.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">RELU</span>(<span style="color: #a0522d;">x</span>) (( x &lt; 0 )?0:x)


<span style="color: #483d8b;"># 11</span> <span style="color: #8b2252;">"relu2.c"</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span> = 2.0;
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">y</span> = 127.1;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Uh oh how many pows?</span>
    printf(<span style="color: #8b2252;">"%f\n"</span>, (( pow(x,y) &lt; 0 )?0:pow(x,y)));

}
</pre>
</div>
</div>

<ol class="org-ol">
