week10/presentation.org
**** Easy bugs!

So why doesn't this work?

#+BEGIN_SRC C :exports both :tangle checkinputmacro.c :main no
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

// if checkinput is true then you have an error
#define CHECKINPUT(scanfReturn)  ( scanfReturn == EOF || !scanfReturn )

int main() {
    int myInt = 0;
    if (CHECKINPUT(scanf("%d", &myInt))) {
        printf("Invalid input!");
        exit(1);
    }
    printf("My int: %d\n", myInt);
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -o checkinputmacro checkinputmacro.c
echo   | ./checkinputmacro
echo X | ./checkinputmacro
echo 6 | ./checkinputmacro
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :exports both
gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       checkinputmacro.c > \
       checkinputmacro-expanded.c
#+END_SRC

#+RESULTS:

file:checkinputmacro-expanded.c

Let's look at the output:

#+BEGIN_SRC C :eval no
#define CHECKINPUT(scanfReturn) ( scanfReturn == false || scanfReturn == EOF)

# 8 "checkinputmacro.c"
int main() {
    int myInt = 0;
    if (( scanf("%d", &myInt) == 
# 10 "checkinputmacro.c" 3 4
       0 
# 10 "checkinputmacro.c"
       || scanf("%d", &myInt) == 
# 10 "checkinputmacro.c" 3 4
       (-1)
# 10 "checkinputmacro.c"
       )) {
        printf("Invalid input!");
        exit(1);
    }
    printf("My int: %d\n", myInt);
}
#+END_SRC

I'll clear it up for you

#+BEGIN_SRC C :eval no
#define CHECKINPUT(scanfReturn) ( scanfReturn == false || scanfReturn == EOF)

int main() {
    int myInt = 0;
    if (( scanf("%d", &myInt) ==  0 || scanf("%d", &myInt) == (-1))) {
        printf("Invalid input!");
        exit(1);
    }
    printf("My int: %d\n", myInt);
}
#+END_SRC

See? 2 scanfs instead of 1. Great. So macros will copy your tokens,
not your values. They are meta-functions and not real functions.

How do we fix? We assign the result once

#+BEGIN_SRC C :exports both :tangle checkinputmacro-fixed.c :main no
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

// if checkinput is true then you have an error
// horrible and bad style don't do this at home!
static int __ret;
#define CHECKINPUT(scanfReturn)  (__ret = scanfReturn, (__ret== EOF || !__ret ))

int main() {
    int myInt = 0;
    if (CHECKINPUT(scanf("%d", &myInt))) {
        printf("Invalid input!\n");
        exit(1);
    }
    printf("My int: %d\n", myInt);
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -o checkinputmacro-fixed checkinputmacro-fixed.c
echo   | ./checkinputmacro-fixed
echo X | ./checkinputmacro-fixed
echo 6 | ./checkinputmacro-fixed
#+END_SRC

#+RESULTS:
: Invalid input!
: Invalid input!
: My int: 6

#+BEGIN_SRC sh :exports both
gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       checkinputmacro-fixed.c > \
       checkinputmacro-fixed-expanded.c
#+END_SRC

file:checkinputmacro-fixed-expanded.c

#+BEGIN_SRC C :eval no
# 7 "checkinputmacro-fixed.c"
static int __ret;
#define CHECKINPUT(scanfReturn) (__ret = scanfReturn, (__ret== EOF || !__ret ))

int main() {
    int myInt = 0;
    if ((__ret = scanf("%d", &myInt), (__ret== 
# 12 "checkinputmacro-fixed.c" 3 4
       (-1) 
# 12 "checkinputmacro-fixed.c"
       || !__ret ))) {
        printf("Invalid input!\n");
        exit(1);
    }
    printf("My int: %d\n", myInt);
}
#+END_SRC

** Makefiles

I am sick to death of all these shell scripts!

Look at the assignments 1 shell script per question and they mostly
say the same things.

Programmers uses build systems to manage compiling and linking large
programs. They often do not use shell scripts or batch files directly.

Makefiles allow you to use make to build your program. Make is
declarative, dependency based build system.

Makefiles are full of rules for building files.

#+BEGIN_SRC makefile
file-you-want-to-build: dependency1.c dependency2.o dependency3.o
	gcc -o file-you-want-to-build dependency1.c dependency2.o dependency3.o
#+END_SRC

^^^ There is a tab character before the gcc 

To build file-you-want-to-build you type:

    make file-you-want-to-build
    # or perhaps
    make

