week10/presentation.html
<li><a id="orgdd46a80"></a>Easy bugs!<br />
<div class="outline-text-5" id="text-1-4-6-1">
<p>
So why doesn't this work?
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">if checkinput is true then you have an error</span>
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CHECKINPUT</span>(<span style="color: #a0522d;">scanfReturn</span>)  ( scanfReturn == EOF || !scanfReturn )

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">myInt</span> = 0;
    <span style="color: #a020f0;">if</span> (CHECKINPUT(scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt))) {
        printf(<span style="color: #8b2252;">"Invalid input!"</span>);
        exit(1);
    }
    printf(<span style="color: #8b2252;">"My int: %d\n"</span>, myInt);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o checkinputmacro checkinputmacro.c
<span style="color: #483d8b;">echo</span>   | ./checkinputmacro
<span style="color: #483d8b;">echo</span> X | ./checkinputmacro
<span style="color: #483d8b;">echo</span> 6 | ./checkinputmacro
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       checkinputmacro.c &gt; <span style="color: #8b2252;">\</span>
       checkinputmacro-expanded.c
</pre>
</div>

<p>
<a href="checkinputmacro-expanded.c">checkinputmacro-expanded.c</a>
</p>

<p>
Let's look at the output:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CHECKINPUT</span>(<span style="color: #a0522d;">scanfReturn</span>) ( scanfReturn == <span style="color: #008b8b;">false</span> || scanfReturn == EOF)

<span style="color: #483d8b;"># 8</span> <span style="color: #8b2252;">"checkinputmacro.c"</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">myInt</span> = 0;
    <span style="color: #a020f0;">if</span> (( scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt) == 
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinputmacro.c"</span> 3 4
       0 
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinputmacro.c"</span>
       || scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt) == 
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinputmacro.c"</span> 3 4
       (-1)
<span style="color: #483d8b;"># 10</span> <span style="color: #8b2252;">"checkinputmacro.c"</span>
       )) {
        printf(<span style="color: #8b2252;">"Invalid input!"</span>);
        exit(1);
    }
    printf(<span style="color: #8b2252;">"My int: %d\n"</span>, myInt);
}
</pre>
</div>

<p>
I'll clear it up for you
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CHECKINPUT</span>(<span style="color: #a0522d;">scanfReturn</span>) ( scanfReturn == <span style="color: #008b8b;">false</span> || scanfReturn == EOF)

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">myInt</span> = 0;
    <span style="color: #a020f0;">if</span> (( scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt) ==  0 || scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt) == (-1))) {
        printf(<span style="color: #8b2252;">"Invalid input!"</span>);
        exit(1);
    }
    printf(<span style="color: #8b2252;">"My int: %d\n"</span>, myInt);
}
</pre>
</div>

<p>
See? 2 scanfs instead of 1. Great. So macros will copy your tokens,
not your values. They are meta-functions and not real functions.
</p>

<p>
How do we fix? We assign the result once
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">if checkinput is true then you have an error</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">horrible and bad style don't do this at home!</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">__ret</span>;
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CHECKINPUT</span>(<span style="color: #a0522d;">scanfReturn</span>)  (__ret = scanfReturn, (__ret== EOF || !__ret ))

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">myInt</span> = 0;
    <span style="color: #a020f0;">if</span> (CHECKINPUT(scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt))) {
        printf(<span style="color: #8b2252;">"Invalid input!\n"</span>);
        exit(1);
    }
    printf(<span style="color: #8b2252;">"My int: %d\n"</span>, myInt);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o checkinputmacro-fixed checkinputmacro-fixed.c
<span style="color: #483d8b;">echo</span>   | ./checkinputmacro-fixed
<span style="color: #483d8b;">echo</span> X | ./checkinputmacro-fixed
<span style="color: #483d8b;">echo</span> 6 | ./checkinputmacro-fixed
</pre>
</div>

<pre class="example">
Invalid input!
Invalid input!
My int: 6
</pre>


<div class="org-src-container">
<pre class="src src-sh">gcc -E -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       checkinputmacro-fixed.c &gt; <span style="color: #8b2252;">\</span>
       checkinputmacro-fixed-expanded.c
</pre>
</div>

<p>
<a href="checkinputmacro-fixed-expanded.c">checkinputmacro-fixed-expanded.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;"># 7</span> <span style="color: #8b2252;">"checkinputmacro-fixed.c"</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">__ret</span>;
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CHECKINPUT</span>(<span style="color: #a0522d;">scanfReturn</span>) (__ret = scanfReturn, (__ret== EOF || !__ret ))

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">myInt</span> = 0;
    <span style="color: #a020f0;">if</span> ((__ret = scanf(<span style="color: #8b2252;">"%d"</span>, &amp;myInt), (__ret== 
<span style="color: #483d8b;"># 12</span> <span style="color: #8b2252;">"checkinputmacro-fixed.c"</span> 3 4
       (-1) 
<span style="color: #483d8b;"># 12</span> <span style="color: #8b2252;">"checkinputmacro-fixed.c"</span>
       || !__ret ))) {
        printf(<span style="color: #8b2252;">"Invalid input!\n"</span>);
        exit(1);
    }
    printf(<span style="color: #8b2252;">"My int: %d\n"</span>, myInt);
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org6b906da" class="outline-3">
<h3 id="org6b906da"><span class="section-number-3">1.5</span> Makefiles</h3>
<div class="outline-text-3" id="text-1-5">
<p>
I am sick to death of all these shell scripts!
</p>

<p>
Look at the assignments 1 shell script per question and they mostly
say the same things.
</p>

<p>
Programmers uses build systems to manage compiling and linking large
programs. They often do not use shell scripts or batch files directly.
</p>

<p>
Makefiles allow you to use make to build your program. Make is
declarative, dependency based build system.
</p>

<p>
Makefiles are full of rules for building files.
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #0000ff;">file-you-want-to-build</span>: dependency1.c dependency2.o dependency3.o
        gcc -o file-you-want-to-build dependency1.c dependency2.o dependency3.o
</pre>
</div>

<p>
^^^ There is a tab character before the gcc 
</p>

<p>
To build file-you-want-to-build you type:
</p>

<p>
make file-you-want-to-build
</p>

<p>
make
</p>
</div>
