week10/presentation.org
*** Basic Makefile

We're going to use the coolbears source code from before.

Instead of this:

#+BEGIN_SRC sh :exports both :tangle build-coolbears.sh
# build coolbears.o
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -c coolbears.c
# build coolbears-driver and link it to coolbears.o
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
       -o coolbears-driver coolbears-driver.c \
       coolbears.o 
./coolbears-driver
#+END_SRC

#+BEGIN_SRC makefile :tangle Makefile.coolbears
# this just runs a command but ensures it is built
# first directive runs by default
# usually you should but put the top level build directive here
run: coolbears-driver
	./coolbears-driver # just a shell command

# build an object file
coolbears.o: coolbears.c
	gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c

# build an executable
coolbears-driver: coolbears-driver.c coolbears.o
	gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
	-o coolbears-driver coolbears-driver.c \
	coolbears.o 

# clean is idiomatic for remove object files and executables
clean: 
	rm coolbears.o coolbears-driver || echo nothing to delete

#+END_SRC

let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.

#+BEGIN_SRC sh
make -f Makefile.coolbears clean
make -f Makefile.coolbears coolbears.o
make -f Makefile.coolbears coolbears-driver
make -f Makefile.coolbears run
#+END_SRC

#+RESULTS:
: rm coolbears.o coolbears-driver || echo nothing to delete
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
:         -c coolbears.c
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

Or we could just do this:
#+BEGIN_SRC sh
# I am making clean just to clear out the executables and object files
make -f Makefile.coolbears clean
make -f Makefile.coolbears run
#+END_SRC

#+RESULTS:
: rm coolbears.o coolbears-driver || echo nothing to delete
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
:         -c coolbears.c
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

OR we could do this!

#+BEGIN_SRC sh
# I am making clean just to clear out the executables and object files
make -f Makefile.coolbears clean
make -f Makefile.coolbears
#+END_SRC

#+RESULTS:
: rm coolbears.o coolbears-driver || echo nothing to delete
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
:         -c coolbears.c
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

Ha it does the same thing!


What if I run make again?

#+BEGIN_SRC sh
# I am making clean just to clear out the executables and object files
make -f Makefile.coolbears
#+END_SRC

#+RESULTS:
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

It just uses the old object files.

#+BEGIN_SRC sh
# if I remove the executable it'll rebuild only the executable
rm coolbears-driver
make -f Makefile.coolbears
#+END_SRC

#+RESULTS:
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

#+BEGIN_SRC sh
# if I remove the object files it'll build the whole thing
rm *.o
make -f Makefile.coolbears
#+END_SRC

#+RESULTS:
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
:         -c coolbears.c
: gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin


Personally I would've preferred if assignments were done this way.

*** DRY Makefile

DRY means DON'T REPEAT YOURSELF.

Let's make a makefile that is easier to use and less prone to errors
by repeating text.

Instead of this:

#+BEGIN_SRC makefile :tangle Makefile.coolbears
# this just runs a command but ensures it is built
run: coolbears-driver
	./coolbears-driver # just a shell command

# build an object file
coolbears.o: coolbears.c
	gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c

# build an executable
coolbears-driver: coolbears-driver.c coolbears.o
	gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
	-o coolbears-driver coolbears-driver.c \
	coolbears.o 

# clean is idiomatic for remove object files and executables
clean: 
	rm coolbears.o coolbears-driver || echo nothing to delete


#+END_SRC

We're going to automate our Makefile a little more with variables.

You can make a variable in a makefile by going
   VARNAME=some string of stuff
   LISTNAME=item1 item2 item3 item4
   SCALARNAME="SCALAR VALUE"

#+BEGIN_SRC makefile :tangle Makefile.coolbears.dry
# common arguments for GCC
CFLAGS= -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3
# Common compiler
CC=gcc
BUILDABLES=coolbears.o coolbears-driver

# this just runs a command but ensures it is built
run: coolbears-driver
	./coolbears-driver # just a shell command

coolbears.o: coolbears.c
	$(CC) $(CFLAGS) \
        -c coolbears.c

# build an executable
coolbears-driver: coolbears-driver.c coolbears.o
	$(CC) $(CFLAGS) \
	-o coolbears-driver coolbears-driver.c \
	coolbears.o 

# clean is idiomatic for remove object files and executables
clean: 
	rm $(BUILDABLES) || echo nothing to delete
#+END_SRC

let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.

#+BEGIN_SRC sh
make -f Makefile.coolbears.dry run
#+END_SRC

#+RESULTS:
: gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
:         -c coolbears.c
: gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
: -o coolbears-driver coolbears-driver.c \
: coolbears.o 
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

