week10/presentation.html

<div id="outline-container-org7ea78d5" class="outline-4">
<h4 id="org7ea78d5"><span class="section-number-4">1.5.1</span> Basic Makefile</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
We're going to use the coolbears source code from before.
</p>

<p>
Instead of this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">build coolbears.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -c coolbears.c
<span style="color: #b22222;"># </span><span style="color: #b22222;">build coolbears-driver and link it to coolbears.o</span>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 <span style="color: #8b2252;">\</span>
       -o coolbears-driver coolbears-driver.c <span style="color: #8b2252;">\</span>
       coolbears.o 
./coolbears-driver
</pre>
</div>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">this just runs a command but ensures it is built</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">first directive runs by default</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">usually you should but put the top level build directive here</span>
<span style="color: #0000ff;">run</span>: coolbears-driver
        ./coolbears-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">just a shell command</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an object file</span>
<span style="color: #0000ff;">coolbears.o</span>: coolbears.c
        gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an executable</span>
<span style="color: #0000ff;">coolbears-driver</span>: coolbears-driver.c coolbears.o
        gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -o coolbears-driver coolbears-driver.c \
        coolbears.o 

<span style="color: #b22222;"># </span><span style="color: #b22222;">clean is idiomatic for remove object files and executables</span>
<span style="color: #0000ff;">clean</span>: 
        rm coolbears.o coolbears-driver || echo nothing to delete

</pre>
</div>

<p>
let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.
</p>

<div class="org-src-container">
<pre class="src src-sh">make -f Makefile.coolbears clean
make -f Makefile.coolbears coolbears.o
make -f Makefile.coolbears coolbears-driver
make -f Makefile.coolbears run
</pre>
</div>

<pre class="example">
rm coolbears.o coolbears-driver || echo nothing to delete
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>


<p>
Or we could just do this:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">I am making clean just to clear out the executables and object files</span>
make -f Makefile.coolbears clean
make -f Makefile.coolbears run
</pre>
</div>

<pre class="example">
rm coolbears.o coolbears-driver || echo nothing to delete
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>


<p>
OR we could do this!
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">I am making clean just to clear out the executables and object files</span>
make -f Makefile.coolbears clean
make -f Makefile.coolbears
</pre>
</div>

<pre class="example">
rm coolbears.o coolbears-driver || echo nothing to delete
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>


<p>
Ha it does the same thing!
</p>


<p>
What if I run make again?
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">I am making clean just to clear out the executables and object files</span>
make -f Makefile.coolbears
</pre>
</div>

<pre class="example">
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>


<p>
It just uses the old object files.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">if I remove the executable it'll rebuild only the executable</span>
rm coolbears-driver
make -f Makefile.coolbears
</pre>
</div>

<pre class="example">
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">if I remove the object files it'll build the whole thing</span>
rm *.o
make -f Makefile.coolbears
</pre>
</div>

<pre class="example">
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>



<p>
Personally I would've preferred if assignments were done this way.
</p>
</div>
</div>

<div id="outline-container-orgfdc0309" class="outline-4">
<h4 id="orgfdc0309"><span class="section-number-4">1.5.2</span> DRY Makefile</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
DRY means DON'T REPEAT YOURSELF.
</p>

<p>
Let's make a makefile that is easier to use and less prone to errors
by repeating text.
</p>

<p>
Instead of this:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">this just runs a command but ensures it is built</span>
<span style="color: #0000ff;">run</span>: coolbears-driver
        ./coolbears-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">just a shell command</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an object file</span>
<span style="color: #0000ff;">coolbears.o</span>: coolbears.c
        gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an executable</span>
<span style="color: #0000ff;">coolbears-driver</span>: coolbears-driver.c coolbears.o
        gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -o coolbears-driver coolbears-driver.c \
        coolbears.o 

<span style="color: #b22222;"># </span><span style="color: #b22222;">clean is idiomatic for remove object files and executables</span>
<span style="color: #0000ff;">clean</span>: 
        rm coolbears.o coolbears-driver || echo nothing to delete


</pre>
</div>

<p>
We're going to automate our Makefile a little more with variables.
</p>

<p>
You can make a variable in a makefile by going
   VARNAME=some string of stuff
   LISTNAME=item1 item2 item3 item4
   SCALARNAME="SCALAR VALUE"
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">common arguments for GCC</span>
<span style="color: #a0522d;">CFLAGS</span>= -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3
<span style="color: #b22222;"># </span><span style="color: #b22222;">Common compiler</span>
<span style="color: #a0522d;">CC</span>=gcc
<span style="color: #a0522d;">BUILDABLES</span>=coolbears.o coolbears-driver

<span style="color: #b22222;"># </span><span style="color: #b22222;">this just runs a command but ensures it is built</span>
<span style="color: #0000ff;">run</span>: coolbears-driver
        ./coolbears-driver <span style="color: #b22222;"># </span><span style="color: #b22222;">just a shell command</span>

<span style="color: #0000ff;">coolbears.o</span>: coolbears.c
        $(<span style="color: #a0522d;">CC</span>) $(<span style="color: #a0522d;">CFLAGS</span>) \
        -c coolbears.c

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an executable</span>
<span style="color: #0000ff;">coolbears-driver</span>: coolbears-driver.c coolbears.o
        $(<span style="color: #a0522d;">CC</span>) $(<span style="color: #a0522d;">CFLAGS</span>) \
        -o coolbears-driver coolbears-driver.c \
        coolbears.o 

<span style="color: #b22222;"># </span><span style="color: #b22222;">clean is idiomatic for remove object files and executables</span>
<span style="color: #0000ff;">clean</span>: 
        rm $(<span style="color: #a0522d;">BUILDABLES</span>) || echo nothing to delete
</pre>
</div>

<p>
let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.
</p>

<div class="org-src-container">
<pre class="src src-sh">make -f Makefile.coolbears.dry run
</pre>
</div>

<pre class="example">
gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
        -c coolbears.c
gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 \
-o coolbears-driver coolbears-driver.c \
coolbears.o 
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>
</div>
</div>
