week10/presentation.org
*** Idiomatic GCC Makefile

Make knows a lot about C. Make comes with default rules that will call
your compiler for you as long as CFLAGS and CC are properly set!

This means it knows how to make an executable. 

It knows how to make an object file. It just needs to know the
dependencies.

You can reuse this makefile as well!

#+BEGIN_SRC makefile :tangle Makefile.coolbears.idiomatic
# common arguments for GCC
CFLAGS= -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3
# Do you need your math lib? Put it here this is the linking libraries
# variable
LDLIBS=-lm
# Common compiler
CC=gcc
OBJECTS=coolbears.o coolbears-driver.o
EXEC=coolbears-driver
BUILDABLES=$(OBJECTS) $(EXEC)

# this just runs a command but ensures it is built
run: $(EXEC)
	./$(EXEC) # just a shell command

# We don't even need to specify how to make coolbears.o
# try commenting and uncommenting this line
# coolbears.o: coolbears.c

# build an executable
# coolbears-driver: coolbears-driver.c coolbears.o

# # this would work too
# coolbears-driver: coolbears-driver.o coolbears.o

$(EXEC): $(OBJECTS)


# clean is idiomatic for remove object files and executables
clean: 
	rm $(BUILDABLES) || echo nothing to delete
#+END_SRC

let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.

#+BEGIN_SRC sh
make -f Makefile.coolbears.idiomatic clean
make -f Makefile.coolbears.idiomatic run
#+END_SRC

#+RESULTS:
: rm coolbears.o coolbears-driver.o coolbears-driver || echo nothing to delete
: gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3   -c -o coolbears-driver.o coolbears-driver.c
: gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3   -c -o coolbears.o coolbears.c
: gcc   coolbears-driver.o coolbears.o  -lm -o coolbears-driver
: ./coolbears-driver # just a shell command
: The coolest bear is Kevin

*** Special Macro Vars

- $@ the target file name

- $< the first dependency

- $? new dependencies that have changed

- $^ all dependencies

- $* target suffix

#+BEGIN_SRC makefile :tangle Makefile.macros
OBJECTS=example.txt 1.txt 2.txt 3.txt

run: example.txt
	echo $@ $< $*
	cat example.txt

example.txt: 1.txt 2.txt 3.txt
	echo First Dependency $<
	echo Target $@
	echo New Deps $?
	echo All Deps $^
	echo target suffix $*
	cat $^ > example.txt

1.txt:
	echo $@ > $@
2.txt:
	echo $@ > $@
3.txt:
	echo $@ > $@

clean:
	rm $(OBJECTS) || echo all good
#+END_SRC

#+BEGIN_SRC sh
make -f Makefile.macros clean
make -f Makefile.macros
#+END_SRC

#+RESULTS:
#+begin_example
rm example.txt 1.txt 2.txt 3.txt || echo all good
echo 1.txt > 1.txt
echo 2.txt > 2.txt
echo 3.txt > 3.txt
echo First Dependency 1.txt
First Dependency 1.txt
echo Target example.txt
Target example.txt
echo New Deps 1.txt 2.txt 3.txt
New Deps 1.txt 2.txt 3.txt
echo All Deps 1.txt 2.txt 3.txt
All Deps 1.txt 2.txt 3.txt
echo target suffix 
target suffix
cat 1.txt 2.txt 3.txt > example.txt
echo run example.txt 
run example.txt
cat example.txt
1.txt
2.txt
3.txt
#+end_example

**** Implicit Rules

Here's an example of implicit rules. Of how we convert 1 file to
another implicitly much like how Make hands C compilation.

#+BEGIN_SRC makefile
############################### Implicit rules ###############################

# Convert a .tex file to a .pdf
%.pdf: %.tex $(ALLDEPS)
	latexmk -pdf $(LATEXMK_OPTS) $*

# Convert SVGs to PDFs
# Requires Inkscape
%.pdf: %.svg
	inkscape -b white -t -T --export-ignore-filters --export-pdfs=$@ $<

# Convert EPSs to PDFs
# epstopdf(1) is often bundled with TeX distributions
%.pdf: %.eps
	epstopdf $<

# Automatically crops the margins of a PDF.
%-crop.pdf: %.pdf
	pdfcrop $<
#+END_SRC

*** Makefile help

The GNU Manual is pretty good

https://www.gnu.org/software/make/manual/html_node/Introduction.html

