week10/presentation.html

<div id="outline-container-org687ce56" class="outline-4">
<h4 id="org687ce56"><span class="section-number-4">1.5.3</span> Idiomatic GCC Makefile</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Make knows a lot about C. Make comes with default rules that will call
your compiler for you as long as CFLAGS and CC are properly set!
</p>

<p>
This means it knows how to make an executable. 
</p>

<p>
It knows how to make an object file. It just needs to know the
dependencies.
</p>

<p>
You can reuse this makefile as well!
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">common arguments for GCC</span>
<span style="color: #a0522d;">CFLAGS</span>= -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3
<span style="color: #b22222;"># </span><span style="color: #b22222;">Do you need your math lib? Put it here this is the linking libraries</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">variable</span>
<span style="color: #a0522d;">LDLIBS</span>=-lm
<span style="color: #b22222;"># </span><span style="color: #b22222;">Common compiler</span>
<span style="color: #a0522d;">CC</span>=gcc
<span style="color: #a0522d;">OBJECTS</span>=coolbears.o coolbears-driver.o
<span style="color: #a0522d;">EXEC</span>=coolbears-driver
<span style="color: #a0522d;">BUILDABLES</span>=$(<span style="color: #a0522d;">OBJECTS</span>) $(<span style="color: #a0522d;">EXEC</span>)

<span style="color: #b22222;"># </span><span style="color: #b22222;">this just runs a command but ensures it is built</span>
<span style="color: #0000ff;">run</span>: $(<span style="color: #a0522d;">EXEC</span>)
        ./$(<span style="color: #a0522d;">EXEC</span>) <span style="color: #b22222;"># </span><span style="color: #b22222;">just a shell command</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">We don't even need to specify how to make coolbears.o</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">try commenting and uncommenting this line</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">coolbears.o: coolbears.c</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">build an executable</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">coolbears-driver: coolbears-driver.c coolbears.o</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;"># this would work too</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">coolbears-driver: coolbears-driver.o coolbears.o</span>

<span style="color: #0000ff;">$(</span><span style="color: #0000ff;">EXEC</span><span style="color: #0000ff;">)</span>: $(<span style="color: #a0522d;">OBJECTS</span>)


<span style="color: #b22222;"># </span><span style="color: #b22222;">clean is idiomatic for remove object files and executables</span>
<span style="color: #0000ff;">clean</span>: 
        rm $(<span style="color: #a0522d;">BUILDABLES</span>) || echo nothing to delete
</pre>
</div>

<p>
let's run it. Normally make just runs Makefile. But if you have your
own makefiles you should use the -f option with make.
</p>

<div class="org-src-container">
<pre class="src src-sh">make -f Makefile.coolbears.idiomatic clean
make -f Makefile.coolbears.idiomatic run
</pre>
</div>

<pre class="example">
rm coolbears.o coolbears-driver.o coolbears-driver || echo nothing to delete
gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3   -c -o coolbears-driver.o coolbears-driver.c
gcc -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3   -c -o coolbears.o coolbears.c
gcc   coolbears-driver.o coolbears.o  -lm -o coolbears-driver
./coolbears-driver # just a shell command
The coolest bear is Kevin
</pre>
</div>
</div>

<div id="outline-container-org2d82ba4" class="outline-4">
<h4 id="org2d82ba4"><span class="section-number-4">1.5.4</span> Special Macro Vars</h4>
<div class="outline-text-4" id="text-1-5-4">
<ul class="org-ul">
<li>$@ the target file name</li>

<li>$&lt; the first dependency</li>

<li>$? new dependencies that have changed</li>

<li>$^ all dependencies</li>

<li>$* target suffix</li>
</ul>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #a0522d;">OBJECTS</span>=example.txt 1.txt 2.txt 3.txt

<span style="color: #0000ff;">run</span>: example.txt
        echo <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> $<span style="color: #008b8b;">&lt;</span> <span style="color: #0000ff;">$</span><span style="color: #008b8b;">*</span>
        cat example.txt

<span style="color: #0000ff;">example.txt</span>: 1.txt 2.txt 3.txt
        echo First Dependency $<span style="color: #008b8b;">&lt;</span>
        echo Target <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span>
        echo New Deps $<span style="color: #008b8b;">?</span>
        echo All Deps $<span style="color: #008b8b;">^</span>
        echo target suffix <span style="color: #0000ff;">$</span><span style="color: #008b8b;">*</span>
        cat $<span style="color: #008b8b;">^</span> &gt; example.txt

<span style="color: #0000ff;">1.txt</span>:
        echo <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> &gt; <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span>
<span style="color: #0000ff;">2.txt</span>:
        echo <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> &gt; <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span>
<span style="color: #0000ff;">3.txt</span>:
        echo <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> &gt; <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span>

<span style="color: #0000ff;">clean</span>:
        rm $(<span style="color: #a0522d;">OBJECTS</span>) || echo all good
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">make -f Makefile.macros clean
make -f Makefile.macros
</pre>
</div>

<pre class="example">
rm example.txt 1.txt 2.txt 3.txt || echo all good
echo 1.txt &gt; 1.txt
echo 2.txt &gt; 2.txt
echo 3.txt &gt; 3.txt
echo First Dependency 1.txt
First Dependency 1.txt
echo Target example.txt
Target example.txt
echo New Deps 1.txt 2.txt 3.txt
New Deps 1.txt 2.txt 3.txt
echo All Deps 1.txt 2.txt 3.txt
All Deps 1.txt 2.txt 3.txt
echo target suffix 
target suffix
cat 1.txt 2.txt 3.txt &gt; example.txt
echo run example.txt 
run example.txt
cat example.txt
1.txt
2.txt
3.txt
</pre>
</div>

<ol class="org-ol">
<li><a id="org95ac0b9"></a>Implicit Rules<br />
<div class="outline-text-5" id="text-1-5-4-1">
<p>
Here's an example of implicit rules. Of how we convert 1 file to
another implicitly much like how Make hands C compilation.
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b22222;">############################### </span><span style="color: #b22222;">Implicit rules ###############################</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Convert a .tex file to a .pdf</span>
<span style="color: #0000ff;">%.pdf</span>: %.tex $(<span style="color: #a0522d;">ALLDEPS</span>)
        latexmk -pdf $(<span style="color: #a0522d;">LATEXMK_OPTS</span>) <span style="color: #0000ff;">$</span><span style="color: #008b8b;">*</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Convert SVGs to PDFs</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Requires Inkscape</span>
<span style="color: #0000ff;">%.pdf</span>: %.svg
        inkscape -b white -t -T --export-ignore-filters --export-pdfs=<span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> $<span style="color: #008b8b;">&lt;</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Convert EPSs to PDFs</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">epstopdf(1) is often bundled with TeX distributions</span>
<span style="color: #0000ff;">%.pdf</span>: %.eps
        epstopdf $<span style="color: #008b8b;">&lt;</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Automatically crops the margins of a PDF.</span>
<span style="color: #0000ff;">%-crop.pdf</span>: %.pdf
        pdfcrop $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfd8c903" class="outline-4">
<h4 id="orgfd8c903"><span class="section-number-4">1.5.5</span> Makefile help</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
The GNU Manual is pretty good
</p>

<p>
<a href="https://www.gnu.org/software/make/manual/html_node/Introduction.html">https://www.gnu.org/software/make/manual/html_node/Introduction.html</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abram Hindle</p>
<p class="date">Created: 2020-03-17 Tue 11:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
